app/views/snapclass/index.html.haml

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ? LIMIT 1  [["id", 11]]
---
        %td= c.title
        %td= Snapuser.find(c.teacher_id).username