app/views/snapproject/edit.html.haml

SELECT "snapusers".* FROM "snapusers" INNER JOIN "user_projects" ON "snapusers"."id" = "user_projects"."snapuser_id" WHERE "user_projects"."snapproject_id" = ?  [["snapproject_id", 29]]
---
	-#remove an owner through edit??
	-old_additional_emails = @project.snapusers.select{|user| user!=current_snapuser}.map{|user| user.email}.join(", ")