app/views/snapproject/index.html.haml

        %td= link_to project.name, snapproject_path(project)
        -project.snapusers.each do |user|
---
SELECT "snapusers".* FROM "snapusers" INNER JOIN "user_projects" ON "snapusers"."id" = "user_projects"."snapuser_id" WHERE "user_projects"."snapproject_id" = ?  [["snapproject_id", 4]]