app/views/snapproject/show.html.haml

    owners:
    - @project.snapusers.each do |user|
---
SELECT "snapusers".* FROM "snapusers" INNER JOIN "user_projects" ON "snapusers"."id" = "user_projects"."snapuser_id" WHERE "user_projects"."snapproject_id" = ?  [["snapproject_id", 13]]

        %tr
          %td= link_to "#{Snapuser.find(comment.snapuser_id).username}", snapuser_path(Snapuser.find(comment.snapuser_id))
---
SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ?  ORDER BY "snapusers"."id" ASC LIMIT 1  [["id", 1]]