app/views/snapuser/projects.html.haml

SELECT "snapprojects".* FROM "snapprojects" INNER JOIN "user_projects" ON "snapprojects"."id" = "user_projects"."snapproject_id" WHERE "user_projects"."snapuser_id" = ?  [["snapuser_id", 1]]
---
  %tbody
    - @user.snapprojects.each do |project|