app/controllers/sessions_controller.rb

  def create
    user = Snapuser.find_by(username: params[:snapuser][:username])
---
SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."username" = ? LIMIT 1  [["username", "kyle"]]