app/controllers/snapclass_controller.rb

  def show
    @class = Snapclass.find(params[:id])
---
SELECT  "snapclasses".* FROM "snapclasses" WHERE "snapclasses"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @classes = Snapclass.all
---
SELECT "snapclasses".* FROM "snapclasses"

  def create
    @user = current_snapuser
    @class = Snapclass.create(class_params)
---
INSERT INTO "snapclasses" ("teacher_id", "title", "description", "privacy") VALUES (?, ?, ?, ?)  [["teacher_id", 11], ["title", "test"], ["description", "none"], ["privacy", "Private"]]