app/controllers/snapuser_controller.rb

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ?  ORDER BY "snapusers"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    id = params[:id]
    @user = Snapuser.find(id)

SELECT "snapusers".* FROM "snapusers"
---
  def index
    @users = Snapuser.all

INSERT INTO "snapusers" ("username", "password", "email", "account_type") VALUES (?, ?, ?, ?)  [["username", "Cool"], ["password", "cool"], ["email", "berkeley.edu"], ["account_type", "basic"]]
---
  def create
    @user = Snapuser.create!(user_params)

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = Snapuser.find params[:id]

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "snapusers" SET "username" = ?, "password" = ?, "email" = ? WHERE "snapusers"."id" = ?  [["username", "teacher1"], ["password", "cool"], ["email", "kool"], ["id", 13]]
---
  def update
    @user = Snapuser.find params[:id]
    @user.update_attributes!(user_params)

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ? LIMIT 1  [["id", 22]]
DELETE FROM "snapusers" WHERE "snapusers"."id" = ?  [["id", 22]]
---
  def destroy
    @user = Snapuser.find(params[:id])
    @user.destroy

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."id" = ?  ORDER BY "snapusers"."id" ASC LIMIT 1  [["id", 2]]
---
  def projects
    @user = Snapuser.find(params[:id])

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = NULL LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 7]]
---
  def messages
    @messages = Conversation.find(params[:conversation_id]).messages

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", 0]]
---
  def reply
    @conversation = Conversation.find(params[:conversation_id])

SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."username" = ? LIMIT 1  [["username", "Natasha"]]
SELECT "conversations".* FROM "conversations" INNER JOIN "user_conversations" ON "conversations"."id" = "user_conversations"."conversation_id" WHERE "user_conversations"."snapuser_id" = ?  [["snapuser_id", 11]]
INSERT INTO "user_conversations" ("snapuser_id", "conversation_id") VALUES (?, ?)  [["snapuser_id", 11], ["conversation_id", 1]]
---
  def create_new_message
    users = params[:conversation][:recipients].split(/ |, |,/)
    accounts = [current_snapuser]
    users.each do |user|
      accounts += [Snapuser.find_by_username(user)]
    end
    @conversation = nil
    @conversations = current_snapuser.conversations
    @conversations.each do |conversation|
      if conversation.check(accounts)
        @conversation = conversation
        break
      end
    end

    if not @conversation
      @conversation = current_snapuser.conversations.create(conversation_params)

INSERT INTO "messages" ("snapuser_id", "message_time", "content", "conversation_id") VALUES (?, ?, ?, ?)  [["snapuser_id", 11], ["message_time", "2015-04-16 05:24:08.686525"], ["content", "text"], ["conversation_id", 13]]
---
    end
    ######
    messages_params = {:snapuser_id => current_snapuser.id, :conversation_id => @conversation, :message_time => DateTime.now, :content => params[:conversation][:text]}
    @conversation.messages.create(messages_params)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT 1  [["id", nil]]
DELETE FROM "user_conversations" WHERE "user_conversations"."conversation_id" = ?  [["conversation_id", 1]]
---
  def destroy
    @conversation = Conversation.find(params[:conversation_id])
    @conversation.destroy