app/controllers/snapproject_controller.rb

  def show
    id = params[:id]
    @project = Snapproject.find(id)
---
SELECT  "snapprojects".* FROM "snapprojects" WHERE "snapprojects"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = current_snapuser
    @project = current_snapuser.snapprojects.create(project_params)
    if not @project.valid?
      flash[:notice] = "Missing required fields"
      redirect_to new_snapproject_path and return
    else
      additional_users = params[:snapproject][:additional_owners].split(/ |, |,/)
      additional_users = additional_users.select{|email| email!=current_snapuser.email}
      additional_users.each do |user|
        u = Snapuser.find_by_email(user)
---
INSERT INTO "snapprojects" ("name", "description", "privacy") VALUES (?, ?, ?)  [["name", "Cool"], ["description", "My first project"], ["privacy", "Private"]]
INSERT INTO "user_projects" ("snapuser_id", "snapproject_id") VALUES (?, ?)  [["snapuser_id", 1], ["snapproject_id", 1]]
SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."email" = ? LIMIT 1  [["email", "kyle@berkeley.edu"]]

  def edit
    @project = Snapproject.find(params[:id])
---
SELECT  "snapprojects".* FROM "snapprojects" WHERE "snapprojects"."id" = ? LIMIT 1  [["id", 4]]

  def update
    @project = Snapproject.find(params[:id])
    @project.update_attributes(project_params)
    if not @project.valid?
      flash[:notice] = "Missing required fields"
      redirect_to edit_snapproject_path(@project) and return
    else
      @project.save
      @project.snapusers.each do |user|
        @project.snapusers.delete(user)
      end
      current_snapuser.snapprojects << @project
      additional_users = params[:snapproject][:additional_owners].split(/ |, |,/)
      additional_users = additional_users.select{|email| email!=current_snapuser.email}
      additional_users.each do |user|
        u = Snapuser.find_by_email(user)
---
SELECT  "snapprojects".* FROM "snapprojects" WHERE "snapprojects"."id" = ? LIMIT 1  [["id", 30]]
UPDATE "snapprojects" SET "privacy" = ? WHERE "snapprojects"."id" = ?  [["privacy", "Public"], ["id", 34]]
SELECT "snapusers".* FROM "snapusers" INNER JOIN "user_projects" ON "snapusers"."id" = "user_projects"."snapuser_id" WHERE "user_projects"."snapproject_id" = ?  [["snapproject_id", 33]]
DELETE FROM "user_projects" WHERE "user_projects"."snapproject_id" = ? AND "user_projects"."snapuser_id" = 2  [["snapproject_id", 33]]
INSERT INTO "user_projects" ("snapuser_id", "snapproject_id") VALUES (?, ?)  [["snapuser_id", 1], ["snapproject_id", 33]]
SELECT  "snapusers".* FROM "snapusers" WHERE "snapusers"."email" = ? LIMIT 1  [["email", "kyle@berkeley.edu"]]

  def destroy
    @project = Snapproject.find(params[:id])
    @project.destroy
---
SELECT  "snapprojects".* FROM "snapprojects" WHERE "snapprojects"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "snapprojects" WHERE "snapprojects"."id" = ?  [["id", 11]]
DELETE FROM "user_projects" WHERE "user_projects"."snapproject_id" = ?  [["snapproject_id", 11]]

  def comment
    @project = Snapproject.find(params[:id])
    Snapcomment.create(comment_params)
---
SELECT  "snapprojects".* FROM "snapprojects" WHERE "snapprojects"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "snapcomments" ("snapuser_id", "snapproject_id", "comment_time", "content") VALUES (?, ?, ?, ?)  [["snapuser_id", 4], ["snapproject_id", 3], ["comment_time", "2015-04-06 07:53:18.513401"], ["content", "Hello"]]